#------------------------------------------------
# 패키지 설치하기
#------------------------------------------------
#install.packages(c("tidyverse", "devtools"), dependencies = T)
#devtools::install_github("taltal-ddj/taltal")

#------------------------------------------------
# library 불러오기
#------------------------------------------------
library(tidyverse)
library(taltal)

#------------------------------------------------
# R기본
#------------------------------------------------
sample <- 1
name <- "배여운"
dates <- as.Date("2019-11-22")

#벡터 활용
sample.n <- c(5, 2, 6, 10, 55)
sum(sample.n)
mean(sample.n)
median(sample.n)


#------------------------------------------------
# 고위공직자 재산 데이터 가져오기
# 두가지 방법이 있음
#------------------------------------------------
df <- highofficer #highofficer이란 데이터를 df란 변수에 저장
df <- read_csv("data.csv")

#------------------------------------------------
# 내가 가진 데이터 살펴보기
#------------------------------------------------
head(df) # 위에서부터 6개 행 살펴보기 반대는 tail()함수
summary(df) # 각 열을 요약해서 보여주기
glimpse(df) # 각 열을 요약해서 보여주기(dplyr패키지 기능)

#------------------------------------------------
# 특정 열이 가지고 있는 고유값 살펴보기
#------------------------------------------------
unique(df$소속_대분류)
unique(df$`재산의 종류`)

#------------------------------------------------
# select
#------------------------------------------------
df %>% 
  select(소속_대분류, 소속_소분류, 현재가액)

#------------------------------------------------
# filter
#------------------------------------------------
df %>% 
  filter(소속_대분류 == "청와대" & 현재가액 > 2500000)

#------------------------------------------------
# mutate
#------------------------------------------------
df %>% 
  mutate(index = str_c(소속_대분류, "-", 소속_소분류, "-", 성명))

df %>% 
  mutate(price = 현재가액 * 1000)

#------------------------------------------------
# group_by & arrange
#------------------------------------------------
df %>% 
  group_by(소속_대분류) %>% 
  summarise(total = sum(현재가액)) %>% 
  arrange(desc(total))

df %>% 
  group_by(소속_대분류) %>% 
  summarise(평균 = mean(현재가액)) %>% 
  arrange(desc(평균))

